prusa3d/Prusa-Firmware-Buddy/lib/CycloneTCP/drivers/mac/mpc57xx_eth_driver.c
/**
 * @file mpc57xx_eth_driver.c
 * @brief NXP MPC57xx Ethernet MAC driver
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2021 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneTCP Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.0.4
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL NIC_TRACE_LEVEL

//Dependencies
#include "device_registers.h"
#include "core/net.h"
#include "drivers/mac/mpc57xx_eth_driver.h"
#include "debug.h"

//Underlying network interface
static NetInterface *nicDriverInterface;

//TX buffer
static uint8_t txBuffer[MPC57XX_ETH_TX_BUFFER_COUNT][MPC57XX_ETH_TX_BUFFER_SIZE]
   __attribute__((aligned(64)));
//RX buffer
static uint8_t rxBuffer[MPC57XX_ETH_RX_BUFFER_COUNT][MPC57XX_ETH_RX_BUFFER_SIZE]
   __attribute__((aligned(64)));
//TX buffer descriptors
static uint32_t txBufferDesc[MPC57XX_ETH_TX_BUFFER_COUNT][8]
   __attribute__((aligned(64)));
//RX buffer descriptors
static uint32_t rxBufferDesc[MPC57XX_ETH_RX_BUFFER_COUNT][8]
   __attribute__((aligned(64)));


//TX buffer index
static uint_t txBufferIndex;
//RX buffer index
static uint_t rxBufferIndex;


/**
 * @brief MPC57xx Ethernet MAC driver
 **/

const NicDriver mpc57xxEthDriver =
{
   NIC_TYPE_ETHERNET,
   ETH_MTU,
   mpc57xxEthInit,
   mpc57xxEthTick,
   mpc57xxEthEnableIrq,
   mpc57xxEthDisableIrq,
   mpc57xxEthEventHandler,
   mpc57xxEthSendPacket,
   mpc57xxEthUpdateMacAddrFilter,
   mpc57xxEthUpdateMacConfig,
   mpc57xxEthWritePhyReg,
   mpc57xxEthReadPhyReg,
   TRUE,
   TRUE,
   TRUE,
   FALSE
};


/**
 * @brief MPC57xx Ethernet MAC initialization
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t mpc57xxEthInit(NetInterface *interface)
{
   error_t error;
   uint32_t value;

   //Debug message
   TRACE_INFO("Initializing MPC57xx Ethernet MAC...\r\n");

   //Save underlying network interface
   nicDriverInterface = interface;

   //GPIO configuration
   mpc57xxEthInitGpio(interface);

   //Reset ENET module
   ENET_0->ECR = ENET_ECR_RESET_MASK;
   //Wait for the reset to complete
   while((ENET_0->ECR & ENET_ECR_RESET_MASK) != 0)
   {
   }

   //Receive control register
   ENET_0->RCR = ENET_RCR_MAX_FL(MPC57XX_ETH_RX_BUFFER_SIZE) |
      ENET_RCR_RMII_MODE_MASK | ENET_RCR_MII_MODE_MASK;

   //Transmit control register
   ENET_0->TCR = 0;
   //Configure MDC clock frequency
   ENET_0->MSCR = ENET_MSCR_MII_SPEED(19);

   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Ethernet PHY initialization
      error = interface->phyDriver->init(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Ethernet switch initialization
      error = interface->switchDriver->init(interface);
   }
   else
   {
      //The interface is not properly configured
      error = ERROR_FAILURE;
   }

   //Any error to report?
   if(error)
   {
      return error;
   }

   //Set the MAC address of the station (upper 16 bits)
   value = interface->macAddr.b[5];
   value |= (interface->macAddr.b[4] << 8);
   ENET_0->PAUR = ENET_PAUR_PADDR2(value) | ENET_PAUR_TYPE(0x8808);

   //Set the MAC address of the station (lower 32 bits)
   value = interface->macAddr.b[3];
   value |= (interface->macAddr.b[2] << 8);
   value |= (interface->macAddr.b[1] << 16);
   value |= (interface->macAddr.b[0] << 24);
   ENET_0->PALR = ENET_PALR_PADDR1(value);

   //Hash table for unicast address filtering
   ENET_0->IALR = 0;
   ENET_0->IAUR = 0;
   //Hash table for multicast address filtering
   ENET_0->GALR = 0;
   ENET_0->GAUR = 0;

   //Disable transmit accelerator functions
   ENET_0->TACC = 0;
   //Disable receive accelerator functions
   ENET_0->RACC = 0;

   //Use enhanced buffer descriptors
   ENET_0->ECR = ENET_ECR_EN1588_MASK;

   //Reset statistics counters
   ENET_0->MIBC = ENET_MIBC_MIB_CLEAR_MASK;
   ENET_0->MIBC = 0;

   //Initialize buffer descriptors
   mpc57xxEthInitBufferDesc(interface);

   //Clear any pending interrupts
   ENET_0->EIR = 0xFFFFFFFF;
   //Enable desired interrupts
   ENET_0->EIMR = ENET_EIMR_TXF_MASK | ENET_EIMR_RXF_MASK | ENET_EIMR_EBERR_MASK;

   //Configure ENET transmit interrupt priority
   INTC->PSR[ENET0_GROUP2_IRQn] = INTC_PSR_PRIN(MPC57XX_ETH_IRQ_PRIORITY);
   //Configure ENET receive interrupt priority
   INTC->PSR[ENET0_GROUP1_IRQn] = INTC_PSR_PRIN(MPC57XX_ETH_IRQ_PRIORITY);
   //Configure ENET error interrupt priority
   INTC->PSR[ENET0_GROUP0_IRQn] = INTC_PSR_PRIN(MPC57XX_ETH_IRQ_PRIORITY);

   //Enable Ethernet MAC
   ENET_0->ECR |= ENET_ECR_ETHEREN_MASK;
   //Instruct the DMA to poll the receive descriptor list
   ENET_0->RDAR = ENET_RDAR_RDAR_MASK;

   //Accept any packets from the upper layer
   osSetEvent(&interface->nicTxEvent);

   //Successful initialization
   return NO_ERROR;
}


//DEVKIT-MPC5748G evaluation board?
#if defined(USE_DEVKIT_MPC5748G)

/**
 * @brief GPIO configuration
 * @param[in] interface Underlying network interface
 **/

void mpc57xxEthInitGpio(NetInterface *interface)
{
   //Configure MII_RMII_0_MDIO (PF14)
   SIUL2->MSCR[94] = SIUL2_MSCR_SRC(3) | SIUL2_MSCR_OBE_MASK |
      SIUL2_MSCR_SMC_MASK | SIUL2_MSCR_IBE_MASK | SIUL2_MSCR_PUS_MASK |
      SIUL2_MSCR_PUE_MASK | SIUL2_MSCR_SSS(4);
   SIUL2->IMCR[450] = SIUL2_IMCR_SSS(1);

